<?php

return [
    /*
    |-----------------------------------------------
    | 默认角色
    |-----------------------------------------------
    | 使用guard全局函数未指定角色时，会返回当前定义的默认角色
    |*/

    'defaults' => [
        'role' => 'user',
    ],

    /*
    |-----------------------------------------------
    | 角色组
    |-----------------------------------------------
    | 每个角色都充当了守卫，一个角色拥有一位模型提供者
    |*/

    'roles'      => [
        'user' => [
            'provider'  => 'users',
            'input_key' => 'access_token',
        ],
        //        'employee' => [
        //            'provider'   => 'employees',
        //            'input_key'  => 'access_token',
        //        ],
    ],

    /*
    |-----------------------------------------------
    | 角色(模型)提供者
    |-----------------------------------------------
    | 提供用户查询功能，键与模型关系为"数据表"=>Eloquent模型
    |
    */

    'providers' => [
        'users' => App\Models\User::class,
//        'employees' => App\Models\Employee::class,
    ],

    /*
    |----------------------------------------------
    * 令牌加密
    |----------------------------------------------
    * 密钥和iv向量需要手动使用openssl生成，请勿泄露
    */
    'security'   => [
        'key'         => '',
        'iv'          => '',
        'cipher_algo' => 'AES-256-CBC',
    ],

    /*
     |----------------------------------------------
     * 令牌过期时间
     |----------------------------------------------
     | 默认过期时间为1天
     */
    'expiration' => 86400,

    /*
    |-----------------------------------------------
    | 存储方式
    |-----------------------------------------------
    | 令牌将存储至默认的redis仓库
    |
    */
    'store'     => [
        'redis' => [
            'connect' => 'default',
        ],
    ],
];
